In [2]:
import pandas as pd
import os

In [3]:
df = pd.read_csv('Connections.csv')

In [12]:
df.describe()

,First Name,Last Name,Email Address,Company,Position,Connected On
count,8588,8588,11,8130,8133,8642
unique,4986,5136,11,5175,4173,1188
top,Abhishek,Kumar,nitin@apisprotect.com,Tata Consultancy Services,Data Scientist,03-Apr-18
freq,63,234,1,93,501,517

In [4]:
df.head(5)

,First Name,Last Name,Email Address,Company,Position,Connected On
0,Ison,Varghese,NaN,NaN,NaN,08-Dec-18
1,Imaad,Mohamed Khan,NaN,Indegene,Data Scientist,08-Dec-18
2,Sagar,Devkate,NaN,NaN,NaN,08-Dec-18
3,Advaith,Rao,NaN,Intelligent creations pvt ltd,Deep learning scientist,08-Dec-18
4,Navya,Sri,NaN,Krish Software Solutions,Sr.Technical Recruiter,08-Dec-18

In [7]:
Company = df.loc[df['Position'] == 'Data Scientist']

In [13]:
Company['Company']

1                                                Indegene
31                            Reliance Industries Limited
35                                              HDFC Bank
36                                                Infosys
52                              Tata Consultancy Services
64                                  CincoGen Technologies
99                        L&T Technology Services Limited
112                                            UpGrad.com
129                          RoboManiax Edutech Pvt. Ltd.
145                                           TMW Systems
180                                  Sears Holdings India
188                            Burning Glass Technologies
206                                   Nexamatic solutions
207                                              Qualcomm
253                                                 Cigna
304                                              Dell EMC
324      Mtag Innovations | Integrity Management Platform
420                                         Self-employed
449                                         PST Analytics
484                                             Accenture
509                                              Param.ai
599                                               Genpact
603                                           Facilio Inc
619                                              Deloitte
627                                        nbnâ„¢ Australia
644                                    UnitedHealth Group
686     Citizenship and Immigration Canada / Citoyenne...
739                                                Swiggy
765                                          Pitney Bowes
839                                        Algorithm king
                              ...
7231                                            Innominds
7232                                        Self-Employed
7236                                    Fractal Analytics
7238                                Vodafone Idea Limited
7240                             Eastman Chemical Company
7247                                      Cyient Insights
7248                                               swiggy
7252                                               H2O.ai
7253                                           GE Digital
7260                                     Monsanto Company
7262                        [24]7 Innnovation Labs- ILabs
7264                                              Agility
7265                                       Shopsense Fynd
7273                                                Nisum
7275                                              saal.ai
7279                        Sageable Technologies Pvt Ltd
7281                                          AsiaCollect
7283                                      Cyient Insights
7284                                            Innominds
7312                                              News UK
7313                    Everlytics Data Science India LLP
7342                      Media iQ Digital India Pvt. Ltd
7364                                             VigiLanz
7507                                                   C3
7585                                           IBM Watson
7796                                              Xoriant
8142                                          Ulytics Inc
8429                                            Microsoft
8559                                                  Jio
8564                            American Family Insurance
Name: Company, Length: 501, dtype: object

In [14]:
Company.to_csv('out.csv')

In [15]:
Company1 = df.loc[df['Position'] == 'Deep learning scientist']

In [16]:
Company1

,First Name,Last Name,Email Address,Company,Position,Connected On
3,Advaith,Rao,NaN,Intelligent creations pvt ltd,Deep learning scientist,08-Dec-18

In [17]:
df['Position']

0                                                     NaN
1                                          Data Scientist
2                                                     NaN
3                                 Deep learning scientist
4                                  Sr.Technical Recruiter
5                                      Software Developer
6                               Microsoft Student Partner
7                                      Faculty in Biology
8       Data Analyst - Analytics & Marketing Intelligence
9                           Application Software Engineer
10                                     Research Associate
11                          Head Of Business & Operations
12                                     Software Developer
13                                                  Chair
14                               MSBI and MSSQL Developer
15                                Machine learning Intern
16                 Assistant Professor (Civil Engineeing)
17                                                    NaN
18                         Information Management Officer
19                             Technical Service Engineer
20                                        Staff Scientist
21                                             Instructor
22                   SQL Server/SSIS (ETL)/SSRS Developer
23                      Application Development Associate
24                                      Intern as Analyst
25                                 Freelance Web Designer
26                                                    NaN
27                               Data Scientist (Level-1)
28                                                 Intern
29                    Assistant Manager - Career Services
                              ...
8612                   Software Development Engineer - II
8613                          Graduate Research Assistant
8614                                               intern
8615                              Staff Software Engineer
8616                   Executive Administrative Assistant
8617                               Senior Product Manager
8618                                                  NaN
8619                         Member of Technical Staff II
8620                             system server operations
8621                     Software Development Engineer II
8622                                    Associate Manager
8623                            Category Planning Manager
8624                                                  NaN
8625                                Technology Specialist
8626                                   Smart Data Manager
8627                                    Software Engineer
8628                                           HR Manager
8629        Lead Trainer and Consultant (Founder SKTekki)
8630                                Management Consultant
8631                                 Academic Coordinator
8632                                   Software Developer
8633                             Senior Software Engineer
8634                          Graduate Teaching Assistant
8635                                           Specialist
8636                                    Software Engineer
8637                                        Founder & CEO
8638                                            Professor
8639                                                  NaN
8640                                 Senior Lead Engineer
8641    Manager II | Product Manager | Digital Innovat...
Name: Position, Length: 8642, dtype: object

In [18]:
df.loc[df['Position'] == 'Machine learning Intern']

,First Name,Last Name,Email Address,Company,Position,Connected On
15,Ashish,Agrawal,NaN,UnFound,Machine learning Intern,07-Dec-18
1099,Rishab,Sharma (Kraken),NaN,Shopsense Fynd,Machine learning Intern,29-May-18

In [81]:
company11 = df.loc[df['Position'] == 'Lead Analyst']
company11.to_csv('out1.csv')

In [83]:
company2 = df.loc[df['Position'] == 'Lead Data Scientist']
company2.to_csv('out2.csv')

In [84]:
company3 = df.loc[df['Position'] == 'Senior Data Analyst']
company3.to_csv('out3.csv')

In [85]:
company4 = df.loc[df['Position'] == 'Technical Analyst']  
company4.to_csv('out4.csv')

In [86]:
company5 = df.loc[df['Position'] == 'Junior Data Analyst']  
company5.to_csv('out5.csv')

In [87]:
company6 = df.loc[df['Position'] == 'Lead Data Scientist'] 
company6.to_csv('out6.csv')

In [88]:
company7 = df.loc[df['Position'] == 'Machine Learning Engineer']  
company7.to_csv('out7.csv')

In [89]:
company8 = df.loc[df['Position'] == 'Business Intelligence Analyst'] 
company8.to_csv('out8.csv')

In [90]:
company9 = df.loc[df['Position'] == 'Business Analyst']  
company9.to_csv('out9.csv')

In [91]:
company10 = df.loc[df['Position'] == 'Hadoop Administrator']  
company10.to_csv('out10.csv')

In [92]:
company11 = df.loc[df['Position'] == 'Researcher'] 
company11.to_csv('out11.csv')

In [93]:
company12 = df.loc[df['Position'] == 'Tableau Developer']
company12.to_csv('out12.csv')

In [94]:
company13 = df.loc[df['Position'] == 'Talent Acquisition Lead']
company13.to_csv('out13.csv')

In [95]:
company14 = df.loc[df['Position'] == 'Junior Data Scientist']
company14.to_csv('out14.csv')

In [96]:
company15 = df.loc[df['Position'] == 'data science trainer']
company15.to_csv('out15.csv')

In [97]:
company16 = df.loc[df['Position'] == 'Big Data Engineer']
company16.to_csv('out16.csv')

In [98]:
company17 = df.loc[df['Position'] == 'Statistician']
company17.to_csv('out17.csv')

In [99]:
company18 = df.loc[df['Position'] == 'R&D Engineer']
company18.to_csv('out18.csv')

In [100]:
company19 = df.loc[df['Position'] == 'Lead Recruiter']
company19.to_csv('out19.csv')

In [101]:
company20 = df.loc[df['Position'] == 'Computer Scientist']
company20.to_csv('out20.csv')

In [102]:
company21 = df.loc[df['Position'] == 'Kaggle Expert']
company21.to_csv('out21.csv')

In [104]:
company = df.loc[df['Position'] == 'Data Engineer']
company.to_csv('out22.csv')